<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest Screaming Frog SEO disk image.

Set ARCH to "aarch64" for Apple Silicon or "x86_64" for Intel (default).
	 </string>
	<key>Identifier</key>
	<string>com.github.thenikola.download.ScreamingFrogSEO</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>ScreamingFrogSEOSpider</string>
		<key>ARCH</key>
		<string>x86_64</string>
		<key>VERSION_URL</key>
		<string>https://download.screamingfrog.co.uk/products/seo-spider/getlatestversion.php</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.3.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>([0-9]+\.[0-9]+)</string>
				<key>url</key>
				<string>%VERSION_URL%</string>
				<key>result_output_var_name</key>
				<string>VERSION</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
				<key>url</key>
				<string>https://download.screamingfrog.co.uk/products/seo-spider/ScreamingFrogSEOSpider-%VERSION%-%ARCH%.dmg</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/Screaming Frog SEO Spider.app</string>
				<key>requirement</key>
				<string>identifier "uk.co.screamingfrog.seo.spider" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = CAHEVC3HZC</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
	</array>
</dict>
</plist>
