<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest GoToMeeting disk image and imports into Munki.</string>
    <key>Identifier</key>
    <string>com.github.thenikola.munki.BalsamicMockups</string>
    <key>Input</key>  
    <dict>
        <key>NAME</key>
        <string>BalsamicMockups</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>Utilities</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Mockups offers the same speed and rough feel as sketching with pencil, 
            with the advantage of the digital medium: drag and drop to resize and rearrange 
            elements, make changes without starting over, and your work is clear enough 
            that you'll make sense of them later.
            </string>
            <key>display_name</key>
            <string>BalsamicMockups</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.thenikola.download.BalsamicMockups</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
