<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest DiskCatalogMaker disk image and imports into Munki.</string>
    <key>Identifier</key>
    <string>com.github.thenikola.munki.DiskCatalogMaker</string>
    <key>Input</key>  
    <dict>
        <key>NAME</key>
        <string>DiskCatalogMaker</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>Utilities</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Catalog your discs
- Drag and drop your disk icon onto the catalog window.
- Automatically add a burning disc by Roxio Toast Titanium.
- Use batch scan mode for multiple discs.
- You can also use the generate thumbnail images option.</string>
            <key>display_name</key>
            <string>DiskCatalogMaker</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
            <key>category</key>
            <string>Backup Software</string>
            <key>developer</key>
            <string>Fujiwara Software</string>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.thenikola.download.DiskCatalogMaker</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/downloads/%NAME%.dmg</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
