<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest AutoPKG-Release and imports into Munki.</string>
    <key>Identifier</key>
    <string>com.github.thenikola.munki.AutoPkg-Release</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>AutoPkg-Release</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>MunkiTools</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
                <string>production</string>
            </array>
            <key>description</key>
            <string>AutoPkg is an automation framework for OS X software packaging and distribution, oriented towards the tasks one would normally perform manually to prepare third-party software for mass deployment to managed clients.</string>
            <key>display_name</key>
            <string>AutoPkg</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
            <key>minimum_os_version</key>
	        <string>10.7.2</string>
	        <key>category</key>
			<string>MunkiTools</string>
			<key>developer</key>
			<string>Timothy Sutton</string>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.rtrouton.download.AutoPkg-Release</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
