<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest Deluge disk image.</string>
	<key>Identifier</key>
	<string>com.github.thenikola.download.Deluge</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Deluge</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>href="deluge-([\d\.]+)-macosx-x64\.dmg"</string>
				<key>result_output_var_name</key>
				<string>version</string>
				<key>url</key>
				<string>http://download.deluge-torrent.org/mac_osx/?C=M;O=D</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>http://download.deluge-torrent.org/mac_osx/deluge-%version%-macosx-x64.dmg</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
